[
    {
        "id": 2,
        "title": "How to manage stress?",
        "date": "August 11, 2025",
        "messages": [
            {
                "sender": "user",
                "message": "How to manage stress?",
                "time": "7:19 PM"
            },
            {
                "sender": "bot",
                "message": "It's completely understandable to want to manage stress better. It's something we all deal with from time to time. I'm here to listen if you want to share what's been causing you stress lately. In the meantime, some general strategies that people find helpful include practicing relaxation techniques like deep breathing or meditation, getting regular exercise, ensuring you're getting enough sleep, and connecting with supportive friends and family. Sometimes, even small changes to our daily routine can make a difference. Have you tried any stress management techniques before, and if so, did you find them helpful? If not, we can discuss and go over them.",
                "time": "7:19 PM"
            },
            {
                "sender": "user",
                "message": "ok thanks",
                "time": "7:19 PM"
            },
            {
                "sender": "bot",
                "message": "You're very welcome. I'm glad I could offer some helpful suggestions. Remember, managing stress is an ongoing process, and it's okay to experiment to find what works best for you. If you'd like to explore any of those stress management techniques further, or if you want to talk more about what's causing you stress, I'm here to listen. Even just talking about it can sometimes make a difference. And remember, if you're feeling overwhelmed or like your stress is too much to handle on your own, reaching out to a mental health professional can be a really helpful step. They can provide personalized support and guidance.",
                "time": "7:19 PM"
            }
        ]
    },
    {
        "id": 1,
        "title": "Tell me about anxiety",
        "date": "August 11, 2025",
        "messages": [
            {
                "sender": "user",
                "message": "Tell me about anxiety",
                "time": "5:10 PM"
            },
            {
                "sender": "bot",
                "message": "Anxiety is a natural human emotion that everyone experiences from time to time. It's often described as a feeling of worry, nervousness, or unease, typically about an event or something with an uncertain outcome. However, when anxiety becomes excessive, persistent, and interferes with your daily life, it might indicate an anxiety disorder. These disorders can manifest in different ways, such as generalized anxiety disorder, panic disorder, social anxiety disorder, and others. It's important to remember that you're not alone, and anxiety disorders are treatable. If you're concerned about your anxiety levels, reaching out to a mental health professional can provide you with a proper assessment and guidance. They can help you develop coping strategies and explore treatment options tailored to your specific needs.",
                "time": "5:10 PM"
            },
            {
                "sender": "user",
                "message": "help me in sadness",
                "time": "6:38 PM"
            },
            {
                "sender": "bot",
                "message": "I'm sorry to hear that you're feeling sad. It takes courage to reach out, and I want you to know that I'm here to listen without judgment. Can you tell me a little more about what's been making you feel sad? Sometimes just talking about it can help. There are also some simple things you can try, like spending time in nature, listening to uplifting music, or doing something you enjoy. Remember, it's okay to not be okay. If your sadness is persistent or overwhelming, it might be helpful to talk to a mental health professional. They can provide you with support and guidance. Would you like me to help you find some resources?",
                "time": "6:38 PM"
            }
        ]
    },
    {
        "id": 0,
        "title": "New Conversation",
        "date": "August 11, 2025",
        "messages": []
    }
]